In [2]:
import pandas as pd
x=pd.DataFrame()
x.shape

(0, 0)

In [4]:
index=['a']*6
index

['a', 'a', 'a', 'a', 'a', 'a']

In [10]:
record = [(11, "Daman" , "O+"), 
          (22, "Sachin" , "B+"),
          (33, "Prince" , "O+"),
          (14, "Vanshika" , "A-"),
          (25, "Shikha" , "B+"),
          (36, "Silky" , " B-")]

df = pd.DataFrame(record , columns = ["S_No", "Name", "Blood_Group"])
df

   S_No      Name Blood_Group
0    11     Daman          O+
1    22    Sachin          B+
2    33    Prince          O+
3    14  Vanshika          A-
4    25    Shikha          B+
5    36     Silky          B-

In [12]:
df.head(2)

   S_No    Name Blood_Group
0    11   Daman          O+
1    22  Sachin          B+

In [13]:
df.tail(-2)

   S_No      Name Blood_Group
2    33    Prince          O+
3    14  Vanshika          A-
4    25    Shikha          B+
5    36     Silky          B-

In [16]:
df.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['S_No', 'Name', 'Blood_Group'], dtype='object')]

In [17]:
df.columns

Index(['S_No', 'Name', 'Blood_Group'], dtype='object')

In [18]:
df.S_No

0    11
1    22
2    33
3    14
4    25
5    36
Name: S_No, dtype: int64

In [19]:
type(df.S_No)

pandas.core.series.Series

In [20]:
df.S_No.max()

36

In [21]:
df[df.S_No ==df.S_No.max()]

   S_No   Name Blood_Group
5    36  Silky          B-

In [22]:
df.Name[df.S_No ==df.S_No.max()]

5    Silky
Name: Name, dtype: object

In [25]:
df.drop(2)

   S_No      Name Blood_Group
0    11     Daman          O+
1    22    Sachin          B+
3    14  Vanshika          A-
4    25    Shikha          B+
5    36     Silky          B-

In [26]:
df.drop([1,2])

   S_No      Name Blood_Group
0    11     Daman          O+
3    14  Vanshika          A-
4    25    Shikha          B+
5    36     Silky          B-

In [46]:
df.drop('Name',axis = 1,inplace=True)

In [47]:
df.drop('Name', axis=1)

KeyError: "['Name'] not found in axis"

In [49]:
my_data = ['apple','mango','banana']
my_series = pd.Series(my_data)
my_series

0     apple
1     mango
2    banana
dtype: object